rails_lab6/app/controllers/lab_reports_controller.rb

SELECT "lab_reports".* FROM "lab_reports"
SELECT "users".* FROM "users"
---
  def index
    @lab_reports = LabReport.all
    @users = User.all

SELECT "users".* FROM "users"
---
  def new
    @lab_report = LabReport.new
    @users = User.all

INSERT INTO "lab_reports" ("title", "description", "grade", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users"
---
  def create
    @lab_report = LabReport.new title: params[:lab_report][:title], description: params[:lab_report][:description], user_id: params[:lab_report][:user_id]
    if @lab_report.save
      redirect_to lab_reports_path
    else
      @users = User.all

SELECT "lab_reports".* FROM "lab_reports" WHERE "lab_reports"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def edit
    @lab_report = LabReport.find_by id: params[:id]

SELECT "lab_reports".* FROM "lab_reports" WHERE "lab_reports"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "lab_reports" SET "grade" = ?, "updated_at" = ? WHERE "lab_reports"."id" = ?  [["grade", 6], ["updated_at", "2022-01-03 15:59:53.492883"], ["id", 4]]
---
  def update
    @lab_report = LabReport.find_by id: params[:id]
    if @lab_report.update grade: params[:lab_report][:grade]

SELECT "lab_reports".* FROM "lab_reports" WHERE "lab_reports"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "lab_reports" WHERE "lab_reports"."id" = ?  [["id", 1]]
---
  def destroy
    @lab_report = LabReport.find_by id: params[:id]
    @lab_report.destroy