rails_lab6/app/views/lab_reports/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <p>
    <% user = @users.find {|e| e.id == report.user_id}  %>